'''
EX_1
Напишіть програму shopping_serializer.py.
Створіть набір покупок, у вигляді списку словників з набором продуктів та їх вартістю.
Дані серіалізуйте за допомогою pickle у файл shopping_list.pkl
та за допомогою json у файл shopping_list.json.
'''




'''
EX_2
Напишіть програму shoppping_deserializer.py. 
Візьміть дані з файлів з серіалізованими динними з попереднього завдання та десеріалізуйте їх та виведіть на екран.
'''

'''
EX_3
Напишіть програму shopping_ultra.py, що буде надавати можливість 
додавати нові списки, видаляти вже існуючі, знаходити найдорожчий і найдешевший список з покупками, 
зчитувати дані при першому вході з файлу (де дані серіалізовані) 
та після завершення роботи серіалізувати та зберігати у файл (формат серіалізації json). 
'''